hw2/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"  ORDER BY Coulson, Fitz, May, Simmons, "projects"."category" ASC
SELECT "projects".* FROM "projects" WHERE "projects"."user" IN ('Coulson', 'Fitz', 'May', 'Simmons')  ORDER BY description
---
  def index

     category = params[:category] || session[:category]
     case category
       when "title"
         @projects = Project.order(category)
         @title_header = "hilite"
       when "due_date"
         @projects = Project.order(category)
         @due_date_header = "hilite"
       else
         @projects = Project.all
     end

     @all_users = Project.all_users
     @selected_users = params[:users] || session[:users] || {}

     if @selected_users == {}
       @selected_users = Hash[@all_users.map{|user| [user, user]}]

INSERT INTO "projects" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-02-17 00:55:32.291558"], ["updated_at", "2016-02-17 00:55:32.291558"]]
---
  def create
    @project = Project.create!(params[:project])